In [1]:
import pandas as pd
df=pd.read_csv(r'Car_sales.csv')
df.head(1)

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14

In [2]:
df.isnull().sum()

Manufacturer           0
Model                  0
Sales in thousands     0
4-year resale value    0
Vehicle type           0
Price in thousands     0
Engine size            0
Horsepower             0
Wheelbase              0
Width                  0
Length                 0
Curb weight            0
Fuel capacity          0
Fuel efficiency        0
Latest Launch          0
dtype: int64

In [3]:
df.shape

(157, 15)

In [4]:
df.head()

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14
1,Acura,TL,39.384,19.875,Passenger,28.4,3.2,225,108.1,70.3,192.9,3.517,17.2,25,6-Mar-15
2,Acura,CL,14.114,18.225,Passenger,.,3.2,225,106.9,70.6,192,3.47,17.2,26,1-Apr-14
3,Acura,RL,8.588,29.725,Passenger,42,3.5,210,114.6,71.4,196.6,3.85,18,22,3-Oct-15
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150,102.6,68.2,178,2.998,16.4,27,10-Aug-15

In [5]:
df.dtypes

Manufacturer            object
Model                   object
Sales in thousands     float64
4-year resale value     object
Vehicle type            object
Price in thousands      object
Engine size             object
Horsepower              object
Wheelbase               object
Width                   object
Length                  object
Curb weight             object
Fuel capacity           object
Fuel efficiency         object
Latest Launch           object
dtype: object

In [6]:
df['Manufacturer'].value_counts()

Manufacturer
Dodge            11
Ford             11
Toyota            9
Chevrolet         9
Mercedes-Benz     9
Mitsubishi        7
Nissan            7
Chrysler          7
Volvo             6
Oldsmobile        6
Lexus             6
Mercury           6
Pontiac           6
Volkswagen        6
Saturn            5
Cadillac          5
Honda             5
Plymouth          4
Acura             4
Buick             4
Audi              3
Jeep              3
Porsche           3
Hyundai           3
BMW               3
Lincoln           3
Saab              2
Subaru            2
Jaguar            1
Infiniti          1
Name: count, dtype: int64

In [7]:
total_sales=df.groupby('Manufacturer')['Sales in thousands'].sum()
total_sales

Manufacturer
Acura              79.005
Audi               40.557
BMW                46.505
Buick             242.019
Cadillac          112.178
Chevrolet         554.365
Chrysler          201.721
Dodge             910.149
Ford             2022.635
Honda             592.674
Hyundai           137.326
Infiniti           23.713
Jaguar             15.467
Jeep              293.153
Lexus             106.843
Lincoln            85.634
Mercedes-Benz     117.125
Mercury           237.999
Mitsubishi        180.895
Nissan            399.635
Oldsmobile        178.989
Plymouth           64.001
Pontiac           370.534
Porsche            12.128
Saab               21.306
Saturn            168.850
Subaru             80.135
Toyota            740.205
Volkswagen        209.212
Volvo              75.740
Name: Sales in thousands, dtype: float64

In [8]:
car_name=df[df['Manufacturer']!='Mitsubishi']
car_name

,Manufacturer,Model,Sales in thousands,4-year resale value,Vehicle type,Price in thousands,Engine size,Horsepower,Wheelbase,Width,Length,Curb weight,Fuel capacity,Fuel efficiency,Latest Launch
0,Acura,Integra,16.919,16.36,Passenger,21.5,1.8,140,101.2,67.3,172.4,2.639,13.2,28,2-Feb-14
1,Acura,TL,39.384,19.875,Passenger,28.4,3.2,225,108.1,70.3,192.9,3.517,17.2,25,6-Mar-15
2,Acura,CL,14.114,18.225,Passenger,.,3.2,225,106.9,70.6,192,3.47,17.2,26,1-Apr-14
3,Acura,RL,8.588,29.725,Passenger,42,3.5,210,114.6,71.4,196.6,3.85,18,22,3-Oct-15
4,Audi,A4,20.397,22.255,Passenger,23.99,1.8,150,102.6,68.2,178,2.998,16.4,27,10-Aug-15
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
152,Volvo,V40,3.545,.,Passenger,24.4,1.9,160,100.5,67.6,176.6,3.042,15.8,25,21-Sep-15
153,Volvo,S70,15.245,.,Passenger,27.5,2.4,168,104.9,69.3,185.9,3.208,17.9,25,24-Nov-14
154,Volvo,V70,17.531,.,Passenger,28.8,2.4,168,104.9,69.3,186.2,3.259,17.9,25,25-Jun-15
155,Volvo,C70,3.493,.,Passenger,45.5,2.3,236,104.9,71.5,185.7,3.601,18.5,23,26-Apr-15
156,Volvo,S80,18.969,.,Passenger,36,2.9,201,109.9,72.1,189.8,3.6,21.1,24,14-Nov-15

In [9]:
df['4-year resale value']=pd.to_numeric(df['4-year resale value'],errors='coerce')
df['4-year resale value'].isnull().sum()

36

In [10]:
df['4-year resale value'].dtypes

dtype('float64')

In [11]:
df.dtypes

Manufacturer            object
Model                   object
Sales in thousands     float64
4-year resale value    float64
Vehicle type            object
Price in thousands      object
Engine size             object
Horsepower              object
Wheelbase               object
Width                   object
Length                  object
Curb weight             object
Fuel capacity           object
Fuel efficiency         object
Latest Launch           object
dtype: object

In [12]:
df['4-year resale value'].mean()

18.07297520661157

In [13]:
df['4-year resale value'].median()

14.18

In [14]:
df.describe()

       Sales in thousands  4-year resale value
count          157.000000           121.000000
mean            52.998076            18.072975
std             68.029422            11.453384
min              0.110000             5.160000
25%             14.114000            11.260000
50%             29.450000            14.180000
75%             67.956000            19.875000
max            540.561000            67.550000

In [15]:
df['4-year resale value'].std()

11.453384099225005

In [16]:
average_sales=df.groupby('Vehicle type')['4-year resale value'].mean()
average_sales

Vehicle type
Car          16.297833
Passenger    18.658187
Name: 4-year resale value, dtype: float64

In [17]:
df['Horsepower'].dtype

dtype('O')

In [18]:
df['Horsepower']=pd.to_numeric(df['Horsepower'],errors='coerce')
df['Horsepower'].isnull().sum()

1

In [19]:
df['Horsepower'].dtypes

dtype('float64')

In [20]:
df.groupby('Manufacturer')['Horsepower'].max()

Manufacturer
Acura            225.0
Audi             310.0
BMW              193.0
Buick            240.0
Cadillac         275.0
Chevrolet        345.0
Chrysler         253.0
Dodge            450.0
Ford             240.0
Honda            210.0
Hyundai          148.0
Infiniti         227.0
Jaguar           240.0
Jeep             195.0
Lexus            300.0
Lincoln          300.0
Mercedes-Benz    302.0
Mercury          210.0
Mitsubishi       210.0
Nissan           222.0
Oldsmobile       250.0
Plymouth         253.0
Pontiac          205.0
Porsche          300.0
Saab             185.0
Saturn           137.0
Subaru           165.0
Toyota           230.0
Volkswagen       150.0
Volvo            236.0
Name: Horsepower, dtype: float64

In [21]:
df['Fuel efficiency'].dtypes

dtype('O')

In [22]:
df['Fuel efficiency']=pd.to_numeric(df['Fuel efficiency'],errors='coerce')
df['Fuel efficiency'].isnull().sum()

3

In [23]:
df.groupby(['Manufacturer','Vehicle type'])['Fuel efficiency'].mean()

Manufacturer   Vehicle type
Acura          Passenger       25.250000
Audi           Passenger       23.333333
BMW            Passenger       25.000000
Buick          Passenger       24.250000
Cadillac       Car             15.000000
               Passenger       22.000000
Chevrolet      Passenger       28.444444
Chrysler       Car                   NaN
               Passenger       24.500000
Dodge          Car             18.000000
               Passenger       23.250000
Ford           Car             19.400000
               Passenger       25.666667
Honda          Car             22.000000
               Passenger       29.500000
Hyundai        Passenger       27.666667
Infiniti       Passenger       25.000000
Jaguar         Passenger       21.000000
Jeep           Car             18.666667
Lexus          Car             18.000000
               Passenger       22.250000
Lincoln        Car             15.000000
               Passenger       21.500000
Mercedes-Benz  Car             20.000000
               Passenger       23.875000
Mercury        Car             19.500000
               Passenger       25.750000
Mitsubishi     Car             19.000000
               Passenger       24.400000
Nissan         Car             19.000000
               Passenger       26.666667
Oldsmobile     Car             20.500000
               Passenger       24.666667
Plymouth       Car             24.000000
               Passenger       25.666667
Pontiac        Car             23.000000
               Passenger       25.200000
Porsche        Passenger       22.000000
Saab           Passenger       23.000000
Saturn         Passenger       30.400000
Subaru         Car             24.000000
               Passenger       25.000000
Toyota         Car             22.000000
               Passenger       29.250000
Volkswagen     Passenger       26.166667
Volvo          Passenger       24.500000
Name: Fuel efficiency, dtype: float64

In [26]:
df.groupby(['Manufacturer'])['Model'].count()

Manufacturer
Acura             4
Audi              3
BMW               3
Buick             4
Cadillac          5
Chevrolet         9
Chrysler          7
Dodge            11
Ford             11
Honda             5
Hyundai           3
Infiniti          1
Jaguar            1
Jeep              3
Lexus             6
Lincoln           3
Mercedes-Benz     9
Mercury           6
Mitsubishi        7
Nissan            7
Oldsmobile        6
Plymouth          4
Pontiac           6
Porsche           3
Saab              2
Saturn            5
Subaru            2
Toyota            9
Volkswagen        6
Volvo             6
Name: Model, dtype: int64

In [27]:
df['Price in thousands'].dtypes

dtype('O')

In [28]:
df['Price in thousands']=pd.to_numeric(df['Price in thousands'],errors='coerce')
df['Price in thousands'].isnull().sum()

2

In [29]:
df['Price in thousands'].dtypes

dtype('float64')

In [30]:
df.groupby(['Manufacturer'])['Price in thousands'].mean()

Manufacturer
Acura            30.633333
Audi             39.980000
BMW              33.096667
Buick            26.781250
Cadillac         40.254000
Chevrolet        20.022778
Chrysler         23.430833
Dodge            24.213636
Ford             21.047273
Honda            20.277000
Hyundai          12.165667
Infiniti         29.465000
Jaguar           42.800000
Jeep             20.991667
Lexus            44.055000
Lincoln          41.690000
Mercedes-Benz    52.916667
Mercury          20.748333
Mitsubishi       22.167429
Nissan           22.360714
Oldsmobile       25.622833
Plymouth         22.642500
Pontiac          22.949167
Porsche          62.473333
Saab             29.610000
Saturn           14.271000
Subaru           21.395000
Toyota           21.982889
Volkswagen       17.698333
Volvo            30.933333
Name: Price in thousands, dtype: float64

In [31]:
df['Fuel capacity']=pd.to_numeric(df['Fuel capacity'],errors='coerce')
df['Fuel capacity'].isnull().sum()

1

In [35]:
df.describe()

,Sales in thousands,4-year resale value,Price in thousands,Horsepower,Fuel capacity,Fuel efficiency
count,157.000000,121.000000,155.000000,156.000000,156.000000,154.000000
mean,52.998076,18.072975,27.390755,185.948718,17.951923,23.844156
std,68.029422,11.453384,14.351653,56.700321,3.887921,4.282706
min,0.110000,5.160000,9.235000,55.000000,10.300000,15.000000
25%,14.114000,11.260000,18.017500,149.500000,15.800000,21.000000
50%,29.450000,14.180000,22.799000,177.500000,17.200000,24.000000
75%,67.956000,19.875000,31.947500,215.000000,19.575000,26.000000
max,540.561000,67.550000,85.500000,450.000000,32.000000,45.000000

In [36]:
df.groupby(['Vehicle type'])['Fuel capacity'].sum()

Vehicle type
Car           875.8
Passenger    1924.7
Name: Fuel capacity, dtype: float64

Highest Resale value car for each manufacturer

idxmax()-> it returns row id or column id corresponding to the max value

In [39]:
max_resale=df.groupby(['Manufacturer'])['4-year resale value'].idxmax()
max_resale

Manufacturer
Acura              3.0
Audi               6.0
BMW                9.0
Buick             12.0
Cadillac          15.0
Chevrolet         24.0
Chrysler          33.0
Dodge             39.0
Ford              54.0
Honda             61.0
Hyundai           64.0
Infiniti          65.0
Jaguar             NaN
Jeep              69.0
Lexus             73.0
Lincoln           77.0
Mercedes-Benz     95.0
Mercury           90.0
Mitsubishi        83.0
Nissan           105.0
Oldsmobile       112.0
Plymouth         116.0
Pontiac          120.0
Porsche          126.0
Saab               NaN
Saturn           131.0
Subaru             NaN
Toyota           144.0
Volkswagen       147.0
Volvo              NaN
Name: 4-year resale value, dtype: float64

In [47]:
df['4-year resale value'].isnull().sum()

36

In [49]:
df['4-year resale value'].fillna(0, inplace=True)

In [53]:
max_resale.fillna(0, inplace=True)

In [54]:
df.loc[max_resale,['Manufacturer','Model','4-year resale value']]

      Manufacturer              Model  4-year resale value
3    Acura          RL                              29.725
6    Audi           A8                              39.000
9    BMW            528i                            36.125
12   Buick          Park Avenue                     20.190
15   Cadillac       Seville                         27.100
24   Chevrolet      Corvette                        36.225
33   Chrysler       Town & Country                  19.540
39   Dodge          Viper                           58.470
54   Ford           Expedition                      23.575
61   Honda          Odyssey                         19.490
64   Hyundai        Sonata                           8.910
65   Infiniti       I30                             19.690
0    Acura          Integra                         16.360
69   Jeep           Grand Cherokee                  18.810
73   Lexus          LS400                           40.375
77   Lincoln        Town car                        21.725
95   Mercedes-Benz  SL-Class                        58.600
90   Mercury        Mountaineer                     20.430
83   Mitsubishi     3000GT                          20.940
105  Nissan         Pathfinder                      17.810
112  Oldsmobile     Bravada                         19.925
116  Plymouth       Voyager                         12.025
120  Pontiac        Firebird                        17.805
126  Porsche        Carrera Cabriolet               67.550
0    Acura          Integra                         16.360
131  Saturn         SW                              10.790
0    Acura          Integra                         16.360
144  Toyota         Land Cruiser                    34.080
147  Volkswagen     Passat                          16.725
0    Acura          Integra                         16.360

Number of cars launched per year
Extract the year from the latest launch column and count the no of cars launched in each year

In [56]:
df['Latest Launch']=pd.to_datetime(df['Latest Launch'])
df.dtypes

Manufacturer                   object
Model                          object
Sales in thousands            float64
4-year resale value           float64
Vehicle type                   object
Price in thousands            float64
Engine size                    object
Horsepower                    float64
Wheelbase                      object
Width                          object
Length                         object
Curb weight                    object
Fuel capacity                 float64
Fuel efficiency               float64
Latest Launch          datetime64[ns]
dtype: object

In [58]:
df['Latest Launch'].dt.date.value_counts()

Latest Launch
2014-05-10    2
2015-01-24    2
2015-04-26    2
2015-06-25    2
2015-09-21    2
             ..
2015-07-08    1
2014-02-06    1
2015-10-31    1
2014-01-07    1
2015-10-20    1
Name: count, Length: 130, dtype: int64